-- サンプルチームを追加
INSERT INTO teams
    (teamId, teamName, leaderId, wins, matches)
VALUES
    ('team_001', 'チームA', '100000000001', 0, 0),
    ('team_002', 'チームB', '100000000002', 0, 0),
    ('team_003', 'チームC', '100000000003', 0, 0);

-- サンプルプレイヤーを追加
INSERT INTO players
    (playerId, playerName, teamId1, teamId2, wins, matches, isAdmin)
VALUES

    ('100000000001', 'プレイヤーA1', 'team_001', NULL, 0, 0, 0),
    ('100000000002', 'プレイヤーA2', 'team_001', NULL, 0, 0, 0),
    ('100000000003', 'プレイヤーA3', 'team_001', NULL, 0, 0, 0),
    ('100000000004', 'プレイヤーA4', 'team_001', NULL, 0, 0, 0),
    ('100000000005', 'プレイヤーA5', 'team_001', NULL, 0, 0, 0),
    ('100000000006', 'プレイヤーA6', 'team_001', NULL, 0, 0, 0),
    ('100000000007', 'プレイヤーA7', 'team_001', NULL, 0, 0, 0),
    ('200000000001', 'プレイヤーB1', 'team_002', NULL, 0, 0, 0),
    ('200000000002', 'プレイヤーB2', 'team_002', NULL, 0, 0, 0),
    ('200000000003', 'プレイヤーB3', 'team_002', NULL, 0, 0, 0),
    ('200000000004', 'プレイヤーB4', 'team_002', NULL, 0, 0, 0),
    ('200000000005', 'プレイヤーB5', 'team_002', NULL, 0, 0, 0),
    ('200000000006', 'プレイヤーB6', 'team_002', NULL, 0, 0, 0),
    ('200000000007', 'プレイヤーB7', 'team_002', NULL, 0, 0, 0),
    ('423427095646', 'TREE', NULL, NULL, 0, 0, 1);
